{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "clear_memories_on_bos_token_id": false,
  "clear_memories_on_eos_token_id": false,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 3200,
  "initializer_range": 0.02,
  "intermediate_size": 8640,
  "last_context_length": 1024,
  "max_position_embeddings": 2048,
  "mem_dtype": "bfloat16",
  "mem_group_size": 32,
  "mem_layer": 13,
  "mem_positionals": true,
  "memory_size": 4096,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 26,
  "num_key_value_heads": 32,
  "pad_token_id": 0,
  "pooling_tokens": null,
  "position_type": "Continual",
  "pretraining_tp": 1,
  "ret_attn_layers": [
    14,
    18,
    22,
    26
  ],
  "ret_group_size": 4,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.46.0",
  "update_boundary": null,
  "use_cache": false,
  "use_gate": false,
  "vocab_size": 32000
}
